app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"   ORDER BY created_at DESC
---
  def index
    @all_posts = Post.all.order('created_at DESC')

INSERT INTO "posts" ("created_at", "description", "title", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2014-12-15 22:29:33.344704"], ["description", "minedo"], ["title", "what doth"], ["updated_at", "2014-12-15 22:29:33.344704"]]
---
  def create
    @post = Post.new(post_params)
    if @post.save

SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = $1 LIMIT 1  [["id", 0]]
SELECT "responses".* FROM "responses"  WHERE "responses"."post_id" = 1
---
  def show
    @post = Post.find(params[:id])
    #@response = Response.where(params[:post_id])
    @response = Response.new

    @responses = Response.where(post_id: @post[:id])