app/controllers/responses_controller.rb

SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "responses" ("created_at", "message", "post_id", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
---
  def create
    @post = Post.find(params[:post_id])
    @response = Response.new(response_params)
    @response.post_id = params[:post_id]
    @responses = Response.where(post_id: @post[:id])

    if @response.save